cf/DataProcessors/АнализВлиянияОтменыПроведенияНаРегистрыНакопления.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.4">
	<DataProcessor>
		<Properties>
			<Name>АнализВлиянияОтменыПроведенияНаРегистрыНакопления</Name>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Документ</Name>
					<Type>
						<v8:TypeSet>cfg:DocumentRef</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>ЗависимыеДокументы</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Документ</Name>
							<Type>
								<v8:TypeSet>cfg:DocumentRef</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ИмяРегистра</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>40</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Измерения</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Ресурсы</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</DataProcessor>
</MetaDataObject>

cf/Documents/РеализацияТоваров.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.4">
	<Document>
		<Properties>
			<Name>РеализацияТоваров</Name>
			<BasedOn>
				<xr:Item>Document.ЗаказПокупателя</xr:Item>
				<xr:Item>Document.ИнтернетЗаказПокупателя</xr:Item>
				<xr:Item>Document.ЗаказНаряд</xr:Item>
				<xr:Item>BusinessProcess.РемонтИнструмента</xr:Item>
			</BasedOn>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>AccumulationRegister.СебестоимостьНоменклатуры</xr:Item>
				<xr:Item>AccumulationRegister.ПартииТоваров</xr:Item>
				<xr:Item>AccumulationRegister.СчетчикКупонов</xr:Item>
				<xr:Item>AccumulationRegister.ТоварыСобранные</xr:Item>
				<xr:Item>AccumulationRegister.РозничныеПродажи</xr:Item>
				<xr:Item>AccumulationRegister.Продажи</xr:Item>
				<xr:Item>AccumulationRegister.СборкаЗаказа</xr:Item>
				<xr:Item>AccumulationRegister.ДвижениеТовара</xr:Item>
				<xr:Item>AccumulationRegister.ТоварыВЯчейках</xr:Item>
				<xr:Item>AccumulationRegister.Взаиморасчеты</xr:Item>
				<xr:Item>AccumulationRegister.ИнтернетЗаказПокупателя</xr:Item>
				<xr:Item>AccumulationRegister.СборщикЗаказа</xr:Item>
				<xr:Item>AccumulationRegister.ЗаказыПокупателей</xr:Item>
				<xr:Item>AccumulationRegister.ТоварыВРезерве</xr:Item>
				<xr:Item>AccumulationRegister.ПродажиПоДисконтнымКартам</xr:Item>
				<xr:Item>AccumulationRegister.ПродажиВРозницу</xr:Item>
				<xr:Item>AccumulationRegister.ДолгиПоОтгрузкам</xr:Item>
				<xr:Item>AccumulationRegister.ТоварыНаСкладах</xr:Item>
				<xr:Item>AccumulationRegister.ОтгруженныеЗаказы</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ВходящийНомер</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>11</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Заказ</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.ЗаказПокупателя</v8:Type>
						<v8:Type>cfg:DocumentRef.ЗаказНаряд</v8:Type>
						<v8:Type>cfg:DocumentRef.ИнтернетЗаказПокупателя</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>БанковскийСчетГрузоотправителя</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.БанковскиеСчета</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>БанковскийСчетГрузополучателя</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.БанковскиеСчета</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДисконтнаяКарта</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ИнформационныеКарты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НомерСФ</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>11</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СуммаАванса</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЭтоБыстраяПродажа</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>БезДвиженийПоТоварам</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Смена</Name>
					<Type>
						<v8:Type>cfg:BusinessProcessRef.ПродажаВРозницу</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СниматьРезервИзШапки</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РасчетСкидкиОтЦены</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Товары</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Ячейка</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Ячейки</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Номенклатура</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>НоменклатураУчет</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Количество</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>3</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Цена</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Сумма</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Упаковка</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.УпаковкиНоменклатуры</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>КоличествоВУпаковке</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>3</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ПроцентРучнойСкидки</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>5</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СуммаРучнойСкидки</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СтавкаНДС</Name>
							<Type>
								<v8:Type>cfg:EnumRef.СтавкиНДС</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СуммаНДС</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Заказ</Name>
							<Type>
								<v8:Type>cfg:DocumentRef.ЗаказПокупателя</v8:Type>
								<v8:Type>cfg:DocumentRef.ЗаказНаряд</v8:Type>
								<v8:Type>cfg:DocumentRef.ИнтернетЗаказПокупателя</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Размещение</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Склады</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СкладЯчейкаСборки</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Ячейки</v8:Type>
								<v8:Type>cfg:CatalogRef.Склады</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ПроцентАвтоматическойСкидки</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>5</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СуммаАвтоматическойСкидки</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СуммаБезСкидки</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Сборщик</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ФизическиеЛица</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ИндексСтрокиТовараВРемонте</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>3</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Акция</Name>
							<Type>
								<v8:Type>cfg:DocumentRef.Акция</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>idстроки</Name>
							<Type>
								<v8:TypeSet>cfg:DefinedType.Идентификатор</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Партия</Name>
							<Type>
								<v8:TypeSet>cfg:DefinedType.Партия</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СуммаПартии</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>НомерГТД</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.НомераГТД</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СборочныйЛист</Name>
							<Type>
								<v8:Type>cfg:DocumentRef.СборочныйЛист</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ПлатежныеДокументы</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ДокументОплаты</Name>
							<Type>
								<v8:Type>cfg:DocumentRef.ПриходныйКассовыйОрдер</v8:Type>
								<v8:Type>cfg:DocumentRef.ОплатаБанковскойКартой</v8:Type>
								<v8:Type>cfg:DocumentRef.ПлатежноеПоручениеВходящее</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Сумма</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>idстроки</Name>
							<Type>
								<v8:TypeSet>cfg:DefinedType.Идентификатор</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>СобранныеТовары</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Номенклатура</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Упаковка</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.УпаковкиНоменклатуры</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СборочныйЛист</Name>
							<Type>
								<v8:Type>cfg:DocumentRef.СборочныйЛист</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Количество</Name>
							<Type>
								<v8:TypeSet>cfg:DefinedType.Количество</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

cf/DataProcessors/АнализВлиянияОтменыПроведенияНаРегистрыНакопления/Ext/ObjectModule.bsl
Функция ЗаполнитьЗависимости() Экспорт
	
	// Проверим
	
	Если Не ЗначениеЗаполнено(Документ) Тогда
		
		Сообщение = Новый СообщениеПользователю;
		Сообщение.Текст = "Не выбран документ";
		Сообщение.Сообщить();
		Возврат Ложь;
		
	КонецЕсли;
	
	ЗависимыеДокументы.Очистить();
	
	// Определим регистры накопления
	
	ВидОстатки = Метаданные.СвойстваОбъектов.ВидРегистраНакопления.Остатки;
	
	МетаДок = Документ.Метаданные();
	МетаДок = Документы.РеализацияТоваров.ПустаяСсылка().Метаданные();
	
	Регистры = Новый Структура;
	
	РегНакопления = Метаданные.РегистрыНакопления;
	
	Для Каждого Регистр Из МетаДок.Движения Цикл
		
		Если РегНакопления.Содержит(Регистр) И Регистр.ВидРегистра = ВидОстатки И Регистр.Имя <> "Взаиморасчеты" Тогда
			
			Ресурсы 	= Новый Массив;
			Измерения 	= Новый Массив;
			
			Для Каждого Измерение Из Регистр.Измерения Цикл 
				Измерения.Добавить(Измерение.имя);
			КонецЦикла;
			Для Каждого Ресурс Из Регистр.Ресурсы Цикл 
				Ресурсы.Добавить(Ресурс.имя);
			КонецЦикла;
			
			Регистры.Вставить(Регистр.Имя, Новый Структура("Измерения, Ресурсы", Измерения, Ресурсы));
			
		КонецЕсли;
	КонецЦикла;
	
	// Соорудим запросприходов
	
	стрФормТЗ 	= "";
	стрОтрДвиж 	= "";
	
	Для Каждого Регистр Из Регистры Цикл
		
		// Формирует запрос по временной таблицу
		
		стрРесурсов 	= "";
		стрПрРесурсов 	= "";
		стрУсловий 		= "";
		стрУсловияМинус = "";
		
		Для Каждого Ресурс Из Регистр.Значение.Ресурсы Цикл 
			
			ИмяРесурса = "ВЫБОР КОГДА ВидДвижения = &ВидДвиженияПриход ТОГДА " + Ресурс + " ИНАЧЕ -" + Ресурс + " КОНЕЦ";
			
			стрРесурсов 	= стрРесурсов + ?(стрРесурсов = "","",",") + ИмяРесурса + " " + Ресурс;
			стрУсловий 		= стрУсловий + ?(стрУсловий = "",""," И ") + ИмяРесурса + " > 0";
			стрПрРесурсов 	= стрПрРесурсов + ?(стрПрРесурсов = "","",",") + "СУММА(ВЫБОР КОГДА Рег.ВидДвижения = &ВидДвиженияРасход ТОГДА -Рег." + Ресурс + " ИНАЧЕ Рег." + Ресурс + " КОНЕЦ) " + Ресурс;
			стрУсловияМинус = стрУсловияМинус + ?(стрУсловияМинус = "",""," И ") + "ВЫБОР КОГДА Рег.ВидДвижения = &ВидДвиженияРасход ТОГДА врТабл." + Ресурс + " - Рег." + Ресурс + " < 0 ИНАЧЕ врТабл." + Ресурс + " + Рег." + Ресурс + " < 0 КОНЕЦ";
			
		КонецЦикла;
		
		стрИзмерений 	= "";
		стрГрИзмерений 	= "";
		стрСоедений		= "";
		стрПрИзмерений 	= "";
		
		Для Каждого Измерение Из Регистр.Значение.Измерения Цикл 
			
			стрИзмерений 	= стрИзмерений + ?(стрИзмерений = "","",",") + Измерение;
			стрГрИзмерений 	= стрГрИзмерений + ?(стрГрИзмерений = "","",",") + "Рег." + Измерение;
			стрПрИзмерений 	= стрПрИзмерений + ?(стрПрИзмерений = "","",",") + "ПРЕДСТАВЛЕНИЕ(Рег." + Измерение + ") " + Измерение;
			стрСоедений 	= стрСоедений + ?(стрСоедений = "",""," И ") + "врТабл." + Измерение + " = Рег." + Измерение;
			
		КонецЦикла;
		
		стрОтрДвиж 	= стрОтрДвиж + ?(стрОтрДвиж = "","","
		|;
		|") + "
		|ВЫБРАТЬ Регистратор ДокСсылка, ВЫБОР КОГДА Рег.Регистратор = &Документ ТОГДА ИСТИНА ИНАЧЕ ЛОЖЬ КОНЕЦ ЭтоДокумент, МАКСИМУМ(""" + Регистр.Ключ + """) ИмяРег, МАКСИМУМ(Рег.Период) Период, " + стрПрИзмерений + "," + стрПрРесурсов + "
		|ИЗ РегистрНакопления." + Регистр.Ключ + " Рег
		|
		|ВНУТРЕННЕЕ СОЕДИНЕНИЕ
		|	(
		
		|ВЫБРАТЬ " + стрИзмерений + "," + стрПрРесурсов + "
		|ИЗ РегистрНакопления." + Регистр.Ключ + " Рег
		|ГДЕ 	Регистратор = &Документ 
		|СГРУППИРОВАТЬ ПО " + стрИзмерений + "
		|) врТабл
		
		|ПО
		|	" + стрСоедений + "
		|
		|ГДЕ 	Рег.Период >= &Период
		|
		|СГРУППИРОВАТЬ ПО
		|	Регистратор, ВЫБОР КОГДА Рег.Регистратор = &Документ ТОГДА ИСТИНА ИНАЧЕ ЛОЖЬ КОНЕЦ, " + стрГрИзмерений + "
		|
		|УПОРЯДОЧИТЬ ПО ИмяРег, Период
		|";
		
	КонецЦикла;
	
	Запрос = Новый Запрос(стрОтрДвиж);
	
	Запрос.УстановитьПараметр("Период", 			Документ.Дата);
	Запрос.УстановитьПараметр("ВидДвиженияРасход", 	ВидДвиженияНакопления.Расход);
	Запрос.УстановитьПараметр("ВидДвиженияПриход", 	ВидДвиженияНакопления.Приход);
	Запрос.УстановитьПараметр("Документ", 			Документ);
	
	Нарушители = Новый ТаблицаЗначений;
	Нарушители.Колонки.Добавить("Документ");
	Нарушители.Колонки.Добавить("ИмяРег", 	Новый ОписаниеТипов("Строка"));
	Нарушители.Колонки.Добавить("Ресурс", 	Новый ОписаниеТипов("Строка"));
	Нарушители.Колонки.Добавить("Значение", Новый ОписаниеТипов("Число"));
	
	// Заполним результатом
	
	Выборки = Запрос.ВыполнитьПакет();
	Для Каждого Выборка Из Выборки Цикл // ПО РЕГИСТРАМ
		
		Если Не Выборка.Пустой() Тогда
			
			Выгрузка = Выборка.Выгрузить();
			Выгрузка.Индексы.Добавить("ИмяРег, ЭтоДокумент");
			
			СтрокиДокумента = Выгрузка.НайтиСтроки(Новый Структура("ЭтоДокумент", Истина));
			Для Каждого СтрокаДокумента Из СтрокиДокумента Цикл     // ПО ИЗМРЕНИЯМ ДОКУМЕНТА
				
				Нарушители.Очистить();
				
				// Найдем строки движений
				
				стрИзмерений 	= "";
				СтруктураПоиска = Новый Структура("ЭтоДокумент, ИмяРег", Ложь, СтрокаДокумента.ИмяРег);
				Для Каждого Измерение Из Регистры[СтрокаДокумента.ИмяРег].Измерения Цикл СтруктураПоиска.Вставить(Измерение, СтрокаДокумента[Измерение]);стрИзмерений = стрИзмерений + ?(стрИзмерений = "","","; ") + СтрокаДокумента[Измерение];КонецЦикла;
				СтрокиДвижения = Выгрузка.НайтиСтроки(СтруктураПоиска);
				
				// Спишем для каждого ресурса
				
				стОстаток = Новый Структура;
				Для Каждого Ресурс Из Регистры[СтрокаДокумента.ИмяРег].Ресурсы Цикл стОстаток.Вставить(Ресурс, СтрокаДокумента[Ресурс]); КонецЦикла;
				
				// Разнесем строки
				
				Для Каждого СтрокаДвижения Из СтрокиДвижения Цикл // ПО ДВИЖЕНИЯМ ИЗМЕРЕНИЙ
						
					// По каждому ресурсу
						
					стСписываем = Новый Структура;
					
					Для Каждого Ресурс Из Регистры[СтрокаДвижения.ИмяРег].Ресурсы Цикл  // ПО РЕСУРСАМ
						
						// Последующие нас не интересует, только первый минусовой
						Если Не Нарушители.НайтиСтроки(Новый Структура("ИмяРег, Ресурс",СтрокаДвижения.ИмяРег, Ресурс)).Количество() Тогда 
						
							стОстаток[Ресурс] = стОстаток[Ресурс] + СтрокаДвижения[Ресурс];
							Если стОстаток[Ресурс] < 0  Тогда // вот он!
								
								НовСтрока = Нарушители.Добавить();
								НовСтрока.Документ 		= СтрокаДвижения.ДокСсылка;
								НовСтрока.Ресурс 		= Ресурс;
								НовСтрока.Значение 		= стОстаток[Ресурс];
								НовСтрока.ИмяРег 		= СтрокаДвижения.ИмяРег;
								
								Нарушитель = СтрокаДвижения.ДокСсылка;
								Прервать;
								
							КонецЕсли;
						КонецЕсли;
						
						// Спишем на всякий случай из таблицы чтобы потом дважы не списать его
						СтрокаДвижения[Ресурс] = 0;
						
					КонецЦикла;
				КонецЦикла;
				
				// Запоним проблемы
				
				стрРесурсов = "";
				Для Каждого СтрокаНарушителя Из Нарушители Цикл стрРесурсов = стрРесурсов + ?(стрРесурсов = "","","; ") + СтрокаНарушителя.Ресурс +":" + СтрокаНарушителя.Значение;КонецЦикла;
				
				Если стрРесурсов <> "" Тогда
					
					НовСтрока = ЗависимыеДокументы.Добавить();
					НовСтрока.Документ 		= Нарушитель;
					НовСтрока.Измерения 	= стрИзмерений;
					НовСтрока.Ресурсы 		= стрРесурсов;
					НовСтрока.ИмяРегистра 	= СтрокаДокумента.ИмяРег;
					
				КонецЕсли;
			КонецЦикла;
		КонецЕсли;
	КонецЦикла;
	
	Возврат Истина;
	
КонецФункции
